---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentClosingEventArgs
source: html/939d187e-051c-6a8a-0bb9-6c030b0911a4.htm
---
# Autodesk.Revit.DB.Events.DocumentClosingEventArgs

The event arguments used by the DocumentClosing event.

## Syntax (C#)
```csharp
public class DocumentClosingEventArgs : RevitAPIPreDocEventArgs
```